#include "tasks.h"
#include <iostream>

// В данном файле содержатся функции с будущими решениями. Решайте каждую задачу в теле функции и вызывайте её в 
// файле "cpp_lab1.cpp"

// Напишите программу, которая запрашивает у пользователя целочисленное значение n и выводит на экран сумму всех
// чисел от 1 до n
void task1()
{
    // Ваш код здесь
}

// Напишите программу, которая будет проверять, является ли введеное пользователем слово палиндромом
void task2()
{
    // Ваш код здесь
}

// Напишите программу, которая принимает набор строковых значений у пользователя, а затем выводит их в консоль в
// рамочке из любого символа, например:
// ***********
// * Гаррош  *
// * не      *
// * виноват *
// * !       *
// ***********
void task3()
{
    // Ваш код здесь
}

// Напишите программу, которая принимает на вход от пользователя количество байт и выводит их в более читаемом виде,
// например, в килобайтах, мегабайтах или гигабайтах
void task4()
{
    // Ваш код здесь
}

// Напишите программу, которая принимает на вход список номеров автомобилей в формате "А000АА77" (где 77 - регион),
// и выводит на экран все номера из указанного пользователем региона
void task5()
{
    // Ваш код здесь
}

// Программа принимает на вход список цен на товар за 10 дней. Необходимо вывести на экран интервал цен за 3 дня,
// в течение которых произошел наибольший рост цены
void task6()
{
    // Ваш код здесь
}

// Напишите программу, которая принимает на вход целочисленное значение, а затем выводит на экран массив из цифр
// 1 и 0, являющийся представлением данного числа в двоичной системе исчисления, например:
// Ввод: 34, Вывод: [1,0,0,0,1,0]
void task7()
{
    // Ваш код здесь
}

// * Напишите программу, которая принимает на вход от пользователя количество секунд, затем отсчитывает заданное
// количество секунд с выводом счета на экран
void task8()
{
    // Ваш код здесь
}
